ХМНПФ_Общее/Enums/уп_ТипыВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ТипыВыплат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПенсий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПереводВДругойПФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыРасторженцам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиновременнаяВыплатаОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПенсийОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратМатеринскогоКапитала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СрочнаяПенсияОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратВыплатПравопреемникамОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратЕдиновременнойВыплатыОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратНакопительнойПенсииОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратСрочнойПенсииОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратПенсииНПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратВыплатНаследникамНПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратВыплатРасторженцамНПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыНаследникам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПереводВДругойНПФ_НПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыНаследникамОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежПенсияНПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежРасторжениеНПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежПравопреемникиНПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежНПОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежСВОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежЕВОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежПравопреемникиОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РазделениеСНИЛС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/CommonModules/уп_ОсновнаяПоставка/Ext/Module.bsl
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 01.02.2018 ШадринАВ // ПолучитьТаблицуДанных() // №1323
КонецПроцедуры

&ИзменениеИКонтроль("ПолучитьТаблицуДанных")
Функция ХМПолучитьТаблицуДанных(СсылкаДокумент)

	Если СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсий 
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратПенсииНПО 
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПенсияНПО 
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам 
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойНПФ_НПО 
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатРасторженцамНПО 
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежРасторжениеНПО 
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам 
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатНаследникамНПО
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиНПО
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВзносов Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	уп_ВыплатныеРеестрыСписокПенсионеров.НомерСтроки,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчета,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.Участник,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.ПенсионныйДоговор,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.Схема,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.Сумма,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.НДФЛ,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.ДоверенноеЛицо,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.НачалоПериодаНачисления,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.КонецПериодаНачисления,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.НомерЛицевогоСчета,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.РасчетныйСчет,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.РасчетныйСчет.НомерСчета КАК НомерСчета,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.РасчетныйСчет.Банк.Код КАК БИК,		
		|	уп_ВыплатныеРеестрыСписокПенсионеров.РКО,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.Выплата,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Невыплата,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчетаПриемника
		|ИЗ
		|	Документ.уп_ВыплатныеРеестры.СписокПенсионеров КАК уп_ВыплатныеРеестрыСписокПенсионеров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_ВыплатныеРеестры.НеисполненныеВыплаты КАК уп_ВыплатныеРеестрыНеисполненныеВыплаты
		|		ПО уп_ВыплатныеРеестрыСписокПенсионеров.Ссылка = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Ссылка
		|			И уп_ВыплатныеРеестрыСписокПенсионеров.Участник = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Участник
		|			И уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчета = уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета
		|ГДЕ
		|	уп_ВыплатныеРеестрыСписокПенсионеров.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета, 0) = 0
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ = 0");


	ИначеЕсли СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойПФ 
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС 
		#Вставка
		// +ХМНПФ 01.02.2018 ШадринАВ // ПолучитьТаблицуДанных() // №1323
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратМатеринскогоКапитала
		// -ХМНПФ 01.02.2018 ШадринАВ // ПолучитьТаблицуДанных() // №1323
		#КонецВставки
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатПравопреемникамОПС
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиОПС
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС 
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратЕдиновременнойВыплатыОПС 
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежЕВОПС 
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийОПС 
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратНакопительнойПенсииОПС
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежНПОПС
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.СрочнаяПенсияОПС
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежСВОПС
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратСрочнойПенсииОПС
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратМатеринскогоКапитала
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.РазделениеСНИЛС Тогда


		Запрос = Новый Запрос("ВЫБРАТЬ
		|	уп_ВыплатныеРеестрыДоговорыОПС.НомерСтроки,
		|	уп_ВыплатныеРеестрыДоговорыОПС.ДоговорОПС,
		|	уп_ВыплатныеРеестрыДоговорыОПС.Участник,
		|	уп_ВыплатныеРеестрыДоговорыОПС.Сумма,
		|	уп_ВыплатныеРеестрыДоговорыОПС.НДФЛ,
		|	уп_ВыплатныеРеестрыДоговорыОПС.ДоверенноеЛицо,
		|	уп_ВыплатныеРеестрыДоговорыОПС.НачалоПериодаНачисления,
		|	уп_ВыплатныеРеестрыДоговорыОПС.НомерЛицевогоСчета,
		|	уп_ВыплатныеРеестрыДоговорыОПС.ТипПенсииОПС,
		|	уп_ВыплатныеРеестрыДоговорыОПС.РасчетныйСчет,
		|	уп_ВыплатныеРеестрыДоговорыОПС.РасчетныйСчет.НомерСчета КАК НомерСчета,
		|	уп_ВыплатныеРеестрыДоговорыОПС.РасчетныйСчет.Банк.Код КАК БИК,		
		|	уп_ВыплатныеРеестрыДоговорыОПС.РКО,
		|	уп_ВыплатныеРеестрыДоговорыОПС.Выплата,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.ДоговорОПС, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Невыплата
		|ИЗ
		|	Документ.уп_ВыплатныеРеестры.ДоговорыОПС КАК уп_ВыплатныеРеестрыДоговорыОПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_ВыплатныеРеестры.НеисполненныеВыплаты КАК уп_ВыплатныеРеестрыНеисполненныеВыплаты
		|		ПО уп_ВыплатныеРеестрыДоговорыОПС.Ссылка = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Ссылка
		|			И уп_ВыплатныеРеестрыДоговорыОПС.ДоговорОПС = уп_ВыплатныеРеестрыНеисполненныеВыплаты.ДоговорОПС
		|			И уп_ВыплатныеРеестрыДоговорыОПС.Участник = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Участник
		|ГДЕ
		|	уп_ВыплатныеРеестрыДоговорыОПС.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.ДоговорОПС, 0) = 0
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ = 0");
		//|	И уп_ВыплатныеРеестрыДоговорыОПС.Ссылка.Проведен");

	ИначеЕсли СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийПДС 
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратПенсииПДС 
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПенсияПДС 
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыкупнаяСуммаПДС
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыкупнаяСуммаПДС
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежВыкупнаяСуммаПДС
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойНПФ_ПДС
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПоОсобымОбстоятельствамПДС 
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатыПоОсобымОбстоятельствамПДС 
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежВыплатыПоОсобымОбстоятельствамПДС
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаПДС
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратЕдиновременнаяВыплатаПДС
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежЕВПДС
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПравопреемникамПДС 
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатыПравопреемникамПДС
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиПДС
		ИЛИ СсылкаДокумент.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВзносовПДС Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	уп_ВыплатныеРеестрыСписокПенсионеров.НомерСтроки,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчета,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.Участник,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.ПенсионныйДоговор,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.ТипПенсии,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.Сумма,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.НДФЛ,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.ДоверенноеЛицо,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.НачалоПериодаНачисления,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.КонецПериодаНачисления,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.НомерЛицевогоСчета,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.РасчетныйСчет,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.РасчетныйСчет.НомерСчета КАК НомерСчета,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.РасчетныйСчет.Банк.Код КАК БИК,		
		|	уп_ВыплатныеРеестрыСписокПенсионеров.РКО,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.Выплата,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Невыплата,
		|	уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчетаПриемника
		|ИЗ
		|	Документ.уп_ВыплатныеРеестры.СписокПенсионеровПДС КАК уп_ВыплатныеРеестрыСписокПенсионеров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_ВыплатныеРеестры.НеисполненныеВыплаты КАК уп_ВыплатныеРеестрыНеисполненныеВыплаты
		|		ПО уп_ВыплатныеРеестрыСписокПенсионеров.Ссылка = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Ссылка
		|			И уп_ВыплатныеРеестрыСписокПенсионеров.Участник = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Участник
		|			И уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчета = уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета
		|ГДЕ
		|	уп_ВыплатныеРеестрыСписокПенсионеров.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета, 0) = 0
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ = 0");


	КонецЕсли;

	Запрос.УстановитьПараметр("Ссылка",СсылкаДокумент);

	ЗначениеВозврата = Запрос.Выполнить().Выгрузить();
	Возврат ЗначениеВозврата;
КонецФункции
